In [2]:
import sys
import pandas as pd
import numpy as np

print('python version :' + sys.version)
print('pandas version :' + pd.__version__) # its version is hidden
print('numpy version :' + np.__version__) # its version is hidden

python version :3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]
pandas version :0.23.4
numpy version :1.15.1

In [3]:
filename = r'C:\Users\anshs\00ANSH_PYTHON\04-10-18 [1] NUMPY\PANDAS\cars.csv'

table = pd.read_csv(filename)
print(">>>", type(table), '\n>>>\n', table)

>>> <class 'pandas.core.frame.DataFrame'>
>>>
                                  Model   MPG  Cylinders  Displacement  \
0            chevrolet chevelle malibu  18.0          8         307.0
1                    buick skylark 320  15.0          8         350.0
2                   plymouth satellite  18.0          8         318.0
3                        amc rebel sst  16.0          8         304.0
4                          ford torino  17.0          8         302.0
5                     ford galaxie 500  15.0          8         429.0
6                     chevrolet impala  14.0          8         454.0
7                    plymouth fury iii  14.0          8         440.0
8                     pontiac catalina  14.0          8         455.0
9                   amc ambassador dpl  15.0          8         390.0
10                 dodge challenger se  15.0          8         383.0
11                  plymouth 'cuda 340  14.0          8         340.0
12               chevrolet monte carlo  15.0          8         400.0
13             buick estate wagon (sw)  14.0          8         455.0
14               toyota corona mark ii  24.0          4         113.0
15                     plymouth duster  22.0          6         198.0
16                          amc hornet  18.0          6         199.0
17                       ford maverick  21.0          6         200.0
18                        datsun pl510  27.0          4          97.0
19        volkswagen 1131 deluxe sedan  26.0          4          97.0
20                         peugeot 504  25.0          4         110.0
21                         audi 100 ls  24.0          4         107.0
22                            saab 99e  25.0          4         104.0
23                            bmw 2002  26.0          4         121.0
24                         amc gremlin  21.0          6         199.0
25                           ford f250  10.0          8         360.0
26                           chevy c20  10.0          8         307.0
27                          dodge d200  11.0          8         318.0
28                            hi 1200d   9.0          8         304.0
29                        datsun pl510  27.0          4          97.0
..                                 ...   ...        ...           ...
364           chevrolet cavalier wagon  27.0          4         112.0
365          chevrolet cavalier 2-door  34.0          4         112.0
366         pontiac j2000 se hatchback  31.0          4         112.0
367                     dodge aries se  29.0          4         135.0
368                    pontiac phoenix  27.0          4         151.0
369               ford fairmont futura  24.0          4         140.0
370                     amc concord dl  23.0          4         151.0
371                volkswagen rabbit l  36.0          4         105.0
372                 mazda glc custom l  37.0          4          91.0
373                   mazda glc custom  31.0          4          91.0
374             plymouth horizon miser  38.0          4         105.0
375                     mercury lynx l  36.0          4          98.0
376                   nissan stanza xe  36.0          4         120.0
377                       honda accord  36.0          4         107.0
378                     toyota corolla  34.0          4         108.0
379                        honda civic  38.0          4          91.0
380                 honda civic (auto)  32.0          4          91.0
381                      datsun 310 gx  38.0          4          91.0
382              buick century limited  25.0          6         181.0
383  oldsmobile cutlass ciera (diesel)  38.0          6         262.0
384         chrysler lebaron medallion  26.0          4         156.0
385                     ford granada l  22.0          6         232.0
386                   toyota celica gt  32.0          4         144.0
387                  dodge charger 2.2  36.0          4         135.0
388                   chevrolet camaro  27.0          4         151.0
389                    ford mustang gl  27.0          4         140.0
390                          vw pickup  44.0          4          97.0
391                      dodge rampage  32.0          4         135.0
392                        ford ranger  28.0          4         120.0
393                         chevy s-10  31.0          4         119.0

     Horsepower  Weight  Acceleration  Year  Origin
0         130.0    3504          12.0    70      US
1         165.0    3693          11.5    70      US
2         150.0    3436          11.0    70      US
3         150.0    3433          12.0    70      US
4         140.0    3449          10.5    70      US
5         198.0    4341          10.0    70      US
6         220.0    4354           9.0    70      US
7         215.0    4312           8.5    70      US
8         225.0    4425          10.0    70      US
9         190.0    3850           8.5    70      US
10        170.0    3563          10.0    70      US
11        160.0    3609           8.0    70      US
12        150.0    3761           9.5    70      US
13        225.0    3086          10.0    70      US
14         95.0    2372          15.0    70   Japan
15         95.0    2833          15.5    70      US
16         97.0    2774          15.5    70      US
17         85.0    2587          16.0    70      US
18         88.0    2130          14.5    70   Japan
19         46.0    1835          20.5    70  Europe
20         87.0    2672          17.5    70  Europe
21         90.0    2430          14.5    70  Europe
22         95.0    2375          17.5    70  Europe
23        113.0    2234          12.5    70  Europe
24         90.0    2648          15.0    70      US
25        215.0    4615          14.0    70      US
26        200.0    4376          15.0    70      US
27        210.0    4382          13.5    70      US
28        193.0    4732          18.5    70      US
29         88.0    2130          14.5    71   Japan
..          ...     ...           ...   ...     ...
364        88.0    2640          18.6    82      US
365        88.0    2395          18.0    82      US
366        85.0    2575          16.2    82      US
367        84.0    2525          16.0    82      US
368        90.0    2735          18.0    82      US
369        92.0    2865          16.4    82      US
370         NaN    3035          20.5    82      US
371        74.0    1980          15.3    82  Europe
372        68.0    2025          18.2    82   Japan
373        68.0    1970          17.6    82   Japan
374        63.0    2125          14.7    82      US
375        70.0    2125          17.3    82      US
376        88.0    2160          14.5    82   Japan
377        75.0    2205          14.5    82   Japan
378        70.0    2245          16.9    82   Japan
379        67.0    1965          15.0    82   Japan
380        67.0    1965          15.7    82   Japan
381        67.0    1995          16.2    82   Japan
382       110.0    2945          16.4    82      US
383        85.0    3015          17.0    82      US
384        92.0    2585          14.5    82      US
385       112.0    2835          14.7    82      US
386        96.0    2665          13.9    82   Japan
387        84.0    2370          13.0    82      US
388        90.0    2950          17.3    82      US
389        86.0    2790          15.6    82      US
390        52.0    2130          24.6    82  Europe
391        84.0    2295          11.6    82      US
392        79.0    2625          18.6    82      US
393        82.0    2720          19.4    82      US

[394 rows x 9 columns]

In [4]:
# replacing all indexes

# non unique values.,
"""

# possible  but renders the property of dual access nearly useless
lotsofa = 'a' * len(table)
table.index = list(lotsofa)  #['a','a','a',...]
# print(table)
print(table.loc['a'])  # this becomes similar to calling complete table. single row can't be called now.

"""

# with unique values
curr_index =list(table.index)
new_index = list((str(i)+'a') for i in curr_index)
# print(new_index)
table.index=new_index
print(table)

                                  Model   MPG  Cylinders  Displacement  \
0a            chevrolet chevelle malibu  18.0          8         307.0
1a                    buick skylark 320  15.0          8         350.0
2a                   plymouth satellite  18.0          8         318.0
3a                        amc rebel sst  16.0          8         304.0
4a                          ford torino  17.0          8         302.0
5a                     ford galaxie 500  15.0          8         429.0
6a                     chevrolet impala  14.0          8         454.0
7a                    plymouth fury iii  14.0          8         440.0
8a                     pontiac catalina  14.0          8         455.0
9a                   amc ambassador dpl  15.0          8         390.0
10a                 dodge challenger se  15.0          8         383.0
11a                  plymouth 'cuda 340  14.0          8         340.0
12a               chevrolet monte carlo  15.0          8         400.0
13a             buick estate wagon (sw)  14.0          8         455.0
14a               toyota corona mark ii  24.0          4         113.0
15a                     plymouth duster  22.0          6         198.0
16a                          amc hornet  18.0          6         199.0
17a                       ford maverick  21.0          6         200.0
18a                        datsun pl510  27.0          4          97.0
19a        volkswagen 1131 deluxe sedan  26.0          4          97.0
20a                         peugeot 504  25.0          4         110.0
21a                         audi 100 ls  24.0          4         107.0
22a                            saab 99e  25.0          4         104.0
23a                            bmw 2002  26.0          4         121.0
24a                         amc gremlin  21.0          6         199.0
25a                           ford f250  10.0          8         360.0
26a                           chevy c20  10.0          8         307.0
27a                          dodge d200  11.0          8         318.0
28a                            hi 1200d   9.0          8         304.0
29a                        datsun pl510  27.0          4          97.0
...                                 ...   ...        ...           ...
364a           chevrolet cavalier wagon  27.0          4         112.0
365a          chevrolet cavalier 2-door  34.0          4         112.0
366a         pontiac j2000 se hatchback  31.0          4         112.0
367a                     dodge aries se  29.0          4         135.0
368a                    pontiac phoenix  27.0          4         151.0
369a               ford fairmont futura  24.0          4         140.0
370a                     amc concord dl  23.0          4         151.0
371a                volkswagen rabbit l  36.0          4         105.0
372a                 mazda glc custom l  37.0          4          91.0
373a                   mazda glc custom  31.0          4          91.0
374a             plymouth horizon miser  38.0          4         105.0
375a                     mercury lynx l  36.0          4          98.0
376a                   nissan stanza xe  36.0          4         120.0
377a                       honda accord  36.0          4         107.0
378a                     toyota corolla  34.0          4         108.0
379a                        honda civic  38.0          4          91.0
380a                 honda civic (auto)  32.0          4          91.0
381a                      datsun 310 gx  38.0          4          91.0
382a              buick century limited  25.0          6         181.0
383a  oldsmobile cutlass ciera (diesel)  38.0          6         262.0
384a         chrysler lebaron medallion  26.0          4         156.0
385a                     ford granada l  22.0          6         232.0
386a                   toyota celica gt  32.0          4         144.0
387a                  dodge charger 2.2  36.0          4         135.0
388a                   chevrolet camaro  27.0          4         151.0
389a                    ford mustang gl  27.0          4         140.0
390a                          vw pickup  44.0          4          97.0
391a                      dodge rampage  32.0          4         135.0
392a                        ford ranger  28.0          4         120.0
393a                         chevy s-10  31.0          4         119.0

      Horsepower  Weight  Acceleration  Year  Origin
0a         130.0    3504          12.0    70      US
1a         165.0    3693          11.5    70      US
2a         150.0    3436          11.0    70      US
3a         150.0    3433          12.0    70      US
4a         140.0    3449          10.5    70      US
5a         198.0    4341          10.0    70      US
6a         220.0    4354           9.0    70      US
7a         215.0    4312           8.5    70      US
8a         225.0    4425          10.0    70      US
9a         190.0    3850           8.5    70      US
10a        170.0    3563          10.0    70      US
11a        160.0    3609           8.0    70      US
12a        150.0    3761           9.5    70      US
13a        225.0    3086          10.0    70      US
14a         95.0    2372          15.0    70   Japan
15a         95.0    2833          15.5    70      US
16a         97.0    2774          15.5    70      US
17a         85.0    2587          16.0    70      US
18a         88.0    2130          14.5    70   Japan
19a         46.0    1835          20.5    70  Europe
20a         87.0    2672          17.5    70  Europe
21a         90.0    2430          14.5    70  Europe
22a         95.0    2375          17.5    70  Europe
23a        113.0    2234          12.5    70  Europe
24a         90.0    2648          15.0    70      US
25a        215.0    4615          14.0    70      US
26a        200.0    4376          15.0    70      US
27a        210.0    4382          13.5    70      US
28a        193.0    4732          18.5    70      US
29a         88.0    2130          14.5    71   Japan
...          ...     ...           ...   ...     ...
364a        88.0    2640          18.6    82      US
365a        88.0    2395          18.0    82      US
366a        85.0    2575          16.2    82      US
367a        84.0    2525          16.0    82      US
368a        90.0    2735          18.0    82      US
369a        92.0    2865          16.4    82      US
370a         NaN    3035          20.5    82      US
371a        74.0    1980          15.3    82  Europe
372a        68.0    2025          18.2    82   Japan
373a        68.0    1970          17.6    82   Japan
374a        63.0    2125          14.7    82      US
375a        70.0    2125          17.3    82      US
376a        88.0    2160          14.5    82   Japan
377a        75.0    2205          14.5    82   Japan
378a        70.0    2245          16.9    82   Japan
379a        67.0    1965          15.0    82   Japan
380a        67.0    1965          15.7    82   Japan
381a        67.0    1995          16.2    82   Japan
382a       110.0    2945          16.4    82      US
383a        85.0    3015          17.0    82      US
384a        92.0    2585          14.5    82      US
385a       112.0    2835          14.7    82      US
386a        96.0    2665          13.9    82   Japan
387a        84.0    2370          13.0    82      US
388a        90.0    2950          17.3    82      US
389a        86.0    2790          15.6    82      US
390a        52.0    2130          24.6    82  Europe
391a        84.0    2295          11.6    82      US
392a        79.0    2625          18.6    82      US
393a        82.0    2720          19.4    82      US

[394 rows x 9 columns]

In [5]:
table=table.reset_index(drop=True)
print(table)

                                 Model   MPG  Cylinders  Displacement  \
0            chevrolet chevelle malibu  18.0          8         307.0
1                    buick skylark 320  15.0          8         350.0
2                   plymouth satellite  18.0          8         318.0
3                        amc rebel sst  16.0          8         304.0
4                          ford torino  17.0          8         302.0
5                     ford galaxie 500  15.0          8         429.0
6                     chevrolet impala  14.0          8         454.0
7                    plymouth fury iii  14.0          8         440.0
8                     pontiac catalina  14.0          8         455.0
9                   amc ambassador dpl  15.0          8         390.0
10                 dodge challenger se  15.0          8         383.0
11                  plymouth 'cuda 340  14.0          8         340.0
12               chevrolet monte carlo  15.0          8         400.0
13             buick estate wagon (sw)  14.0          8         455.0
14               toyota corona mark ii  24.0          4         113.0
15                     plymouth duster  22.0          6         198.0
16                          amc hornet  18.0          6         199.0
17                       ford maverick  21.0          6         200.0
18                        datsun pl510  27.0          4          97.0
19        volkswagen 1131 deluxe sedan  26.0          4          97.0
20                         peugeot 504  25.0          4         110.0
21                         audi 100 ls  24.0          4         107.0
22                            saab 99e  25.0          4         104.0
23                            bmw 2002  26.0          4         121.0
24                         amc gremlin  21.0          6         199.0
25                           ford f250  10.0          8         360.0
26                           chevy c20  10.0          8         307.0
27                          dodge d200  11.0          8         318.0
28                            hi 1200d   9.0          8         304.0
29                        datsun pl510  27.0          4          97.0
..                                 ...   ...        ...           ...
364           chevrolet cavalier wagon  27.0          4         112.0
365          chevrolet cavalier 2-door  34.0          4         112.0
366         pontiac j2000 se hatchback  31.0          4         112.0
367                     dodge aries se  29.0          4         135.0
368                    pontiac phoenix  27.0          4         151.0
369               ford fairmont futura  24.0          4         140.0
370                     amc concord dl  23.0          4         151.0
371                volkswagen rabbit l  36.0          4         105.0
372                 mazda glc custom l  37.0          4          91.0
373                   mazda glc custom  31.0          4          91.0
374             plymouth horizon miser  38.0          4         105.0
375                     mercury lynx l  36.0          4          98.0
376                   nissan stanza xe  36.0          4         120.0
377                       honda accord  36.0          4         107.0
378                     toyota corolla  34.0          4         108.0
379                        honda civic  38.0          4          91.0
380                 honda civic (auto)  32.0          4          91.0
381                      datsun 310 gx  38.0          4          91.0
382              buick century limited  25.0          6         181.0
383  oldsmobile cutlass ciera (diesel)  38.0          6         262.0
384         chrysler lebaron medallion  26.0          4         156.0
385                     ford granada l  22.0          6         232.0
386                   toyota celica gt  32.0          4         144.0
387                  dodge charger 2.2  36.0          4         135.0
388                   chevrolet camaro  27.0          4         151.0
389                    ford mustang gl  27.0          4         140.0
390                          vw pickup  44.0          4          97.0
391                      dodge rampage  32.0          4         135.0
392                        ford ranger  28.0          4         120.0
393                         chevy s-10  31.0          4         119.0

     Horsepower  Weight  Acceleration  Year  Origin
0         130.0    3504          12.0    70      US
1         165.0    3693          11.5    70      US
2         150.0    3436          11.0    70      US
3         150.0    3433          12.0    70      US
4         140.0    3449          10.5    70      US
5         198.0    4341          10.0    70      US
6         220.0    4354           9.0    70      US
7         215.0    4312           8.5    70      US
8         225.0    4425          10.0    70      US
9         190.0    3850           8.5    70      US
10        170.0    3563          10.0    70      US
11        160.0    3609           8.0    70      US
12        150.0    3761           9.5    70      US
13        225.0    3086          10.0    70      US
14         95.0    2372          15.0    70   Japan
15         95.0    2833          15.5    70      US
16         97.0    2774          15.5    70      US
17         85.0    2587          16.0    70      US
18         88.0    2130          14.5    70   Japan
19         46.0    1835          20.5    70  Europe
20         87.0    2672          17.5    70  Europe
21         90.0    2430          14.5    70  Europe
22         95.0    2375          17.5    70  Europe
23        113.0    2234          12.5    70  Europe
24         90.0    2648          15.0    70      US
25        215.0    4615          14.0    70      US
26        200.0    4376          15.0    70      US
27        210.0    4382          13.5    70      US
28        193.0    4732          18.5    70      US
29         88.0    2130          14.5    71   Japan
..          ...     ...           ...   ...     ...
364        88.0    2640          18.6    82      US
365        88.0    2395          18.0    82      US
366        85.0    2575          16.2    82      US
367        84.0    2525          16.0    82      US
368        90.0    2735          18.0    82      US
369        92.0    2865          16.4    82      US
370         NaN    3035          20.5    82      US
371        74.0    1980          15.3    82  Europe
372        68.0    2025          18.2    82   Japan
373        68.0    1970          17.6    82   Japan
374        63.0    2125          14.7    82      US
375        70.0    2125          17.3    82      US
376        88.0    2160          14.5    82   Japan
377        75.0    2205          14.5    82   Japan
378        70.0    2245          16.9    82   Japan
379        67.0    1965          15.0    82   Japan
380        67.0    1965          15.7    82   Japan
381        67.0    1995          16.2    82   Japan
382       110.0    2945          16.4    82      US
383        85.0    3015          17.0    82      US
384        92.0    2585          14.5    82      US
385       112.0    2835          14.7    82      US
386        96.0    2665          13.9    82   Japan
387        84.0    2370          13.0    82      US
388        90.0    2950          17.3    82      US
389        86.0    2790          15.6    82      US
390        52.0    2130          24.6    82  Europe
391        84.0    2295          11.6    82      US
392        79.0    2625          18.6    82      US
393        82.0    2720          19.4    82      US

[394 rows x 9 columns]

In [5]:
# slicing

# column position based. note they are edge case exlusive.
# i.e for rows 10:15--> 10,11,12,13,14,14 will be displayed
slice = table.iloc[4, :]
slice2 = table.iloc[20:25, 4:8]

# column name based . note they are edge case inclusive.
# i.e for rows 10:15--> 10,11,12,13,14,15 will bedisplayed 
slice3 = table.loc[10:15, ('Model', 'MPG')]
slice4 = table.loc[15:18, table.columns]
slice5 = table.loc[50:49, :]
slice6 = table.loc[50:50, :]
slice7 = table.loc[30:32, 'MPG':'Weight']
slice8 = table.loc[(20, 21, 22), 'MPG':'Weight']

print('>>>\n', slice, '\n>>>\n', slice2)
print('>>>\n', slice3)
print('>>>\n', slice4)
print('>>>\n', slice5)
print('>>>\n', slice6)
print('>>>\n', slice7)
print('>>>\n', slice8)

In [4]:
# filtering conditions
# just like numpy , pandas can also filter based on certi conditionals
filtered_indexes = table['Horsepower'] > 180
#filtered_indexes = table['Otigine'] == 'US'
#filtered_indexes = table['Cylinders'] > 180 | table['Otigine'] == 'US'
#filtered_indexes = table['Horsepower'] > 180

print('>>>\n', type(filtered_indexes), '>>>\n', filtered_indexes)
print('>>>\n', table[filtered_indexes])
print('>>>\n', table.loc[filtered_indexes, table.columns[2:5]])

>>>
 <class 'pandas.core.series.Series'> >>>
 0      False
1      False
2      False
3      False
4      False
5       True
6       True
7       True
8       True
9       True
10     False
11     False
12     False
13      True
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25      True
26      True
27      True
28      True
29     False
       ...
364    False
365    False
366    False
367    False
368    False
369    False
370    False
371    False
372    False
373    False
374    False
375    False
376    False
377    False
378    False
379    False
380    False
381    False
382    False
383    False
384    False
385    False
386    False
387    False
388    False
389    False
390    False
391    False
392    False
393    False
Name: Horsepower, Length: 394, dtype: bool
>>>
                             Model   MPG  Cylinders  Displacement  Horsepower  \
5                ford galaxie 500  15.0          8         429.0       198.0
6                chevrolet impala  14.0          8         454.0       220.0
7               plymouth fury iii  14.0          8         440.0       215.0
8                pontiac catalina  14.0          8         455.0       225.0
9              amc ambassador dpl  15.0          8         390.0       190.0
13        buick estate wagon (sw)  14.0          8         455.0       225.0
25                      ford f250  10.0          8         360.0       215.0
26                      chevy c20  10.0          8         307.0       200.0
27                     dodge d200  11.0          8         318.0       210.0
28                       hi 1200d   9.0          8         304.0       193.0
66                mercury marquis  11.0          8         429.0       208.0
69         chrysler newport royal  13.0          8         400.0       190.0
89       mercury marquis brougham  12.0          8         429.0       198.0
93   chrysler new yorker brougham  13.0          8         440.0       215.0
94       buick electra 225 custom  12.0          8         455.0       225.0
115            pontiac grand prix  16.0          8         400.0       230.0
229              chrysler cordoba  15.5          8         400.0       190.0

     Weight  Acceleration  Year Origin
5      4341          10.0    70     US
6      4354           9.0    70     US
7      4312           8.5    70     US
8      4425          10.0    70     US
9      3850           8.5    70     US
13     3086          10.0    70     US
25     4615          14.0    70     US
26     4376          15.0    70     US
27     4382          13.5    70     US
28     4732          18.5    70     US
66     4633          11.0    72     US
69     4422          12.5    72     US
89     4952          11.5    73     US
93     4735          11.0    73     US
94     4951          11.0    73     US
115    4278           9.5    73     US
229    4325          12.2    77     US
>>>
      Cylinders  Displacement  Horsepower
5            8         429.0       198.0
6            8         454.0       220.0
7            8         440.0       215.0
8            8         455.0       225.0
9            8         390.0       190.0
13           8         455.0       225.0
25           8         360.0       215.0
26           8         307.0       200.0
27           8         318.0       210.0
28           8         304.0       193.0
66           8         429.0       208.0
69           8         400.0       190.0
89           8         429.0       198.0
93           8         440.0       215.0
94           8         455.0       225.0
115          8         400.0       230.0
229          8         400.0       190.0

In [5]:
#====================== ==MULTI==INDEXING== =========

In [8]:
import sys
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

print('python version :' + sys.version)
print('pandas version :' + pd.__version__) # its version is hidden
print('numpy version :' + np.__version__) # its version is hidden
#print('matplotlib version :' ) # we haven't imported complete module
print('seaborn version :' + sns.__version__) # its version is hidden

# ---- will understand these lines in later part of course----
sns.set()
%matplotlib inline

python version :3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]
pandas version :0.23.4
numpy version :1.15.1
seaborn version :0.9.0

In [19]:
di = {
    'country': "apple apple pear mango mango".split(' '),
    'capital': "red green green yellow green".split(' '),
    'currency': "!! @@ ## $$ %%".split(' '),
    'population': (988991, 814252, 322231, 10000005, 2187)
}

dframe = pd.DataFrame(di)
dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>country</th>
      <th>capital</th>
      <th>currency</th>
      <th>population</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>apple</td>
      <td>red</td>
      <td>!!</td>
      <td>988991</td>
    </tr>
    <tr>
      <th>1</th>
      <td>apple</td>
      <td>green</td>
      <td>@@</td>
      <td>814252</td>
    </tr>
    <tr>
      <th>2</th>
      <td>pear</td>
      <td>green</td>
      <td>##</td>
      <td>322231</td>
    </tr>
    <tr>
      <th>3</th>
      <td>mango</td>
      <td>yellow</td>
      <td>$$</td>
      <td>10000005</td>
    </tr>
    <tr>
      <th>4</th>
      <td>mango</td>
      <td>green</td>
      <td>%%</td>
      <td>2187</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
# default index is RangeIndex(start=0, stop=5, step=1)
dframe.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
#resetting index
dframe=dframe.set_index(['country'])
dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>capital</th>
      <th>currency</th>
      <th>population</th>
    </tr>
    <tr>
      <th>country</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>apple</th>
      <td>red</td>
      <td>!!</td>
      <td>988991</td>
    </tr>
    <tr>
      <th>apple</th>
      <td>green</td>
      <td>@@</td>
      <td>814252</td>
    </tr>
    <tr>
      <th>pear</th>
      <td>green</td>
      <td>##</td>
      <td>322231</td>
    </tr>
    <tr>
      <th>mango</th>
      <td>yellow</td>
      <td>$$</td>
      <td>10000005</td>
    </tr>
    <tr>
      <th>mango</th>
      <td>green</td>
      <td>%%</td>
      <td>2187</td>
    </tr>
  </tbody>
</table>
</div>

In [22]:
dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>currency</th>
      <th>population</th>
    </tr>
    <tr>
      <th>country</th>
      <th>capital</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="2" valign="top">apple</th>
      <th>red</th>
      <td>!!</td>
      <td>988991</td>
    </tr>
    <tr>
      <th>green</th>
      <td>@@</td>
      <td>814252</td>
    </tr>
    <tr>
      <th>pear</th>
      <th>green</th>
      <td>##</td>
      <td>322231</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">mango</th>
      <th>yellow</th>
      <td>$$</td>
      <td>10000005</td>
    </tr>
    <tr>
      <th>green</th>
      <td>%%</td>
      <td>2187</td>
    </tr>
  </tbody>
</table>
</div>

In [25]:
# working with multi indexes , accessing only the apple country'a data(primary index's data)
print(dframe.xs('apple'))
#or simply
dframe.loc['apple',:]

        currency  population
capital
red           !!      988991
green         @@      814252

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>currency</th>
      <th>population</th>
    </tr>
    <tr>
      <th>capital</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>red</th>
      <td>!!</td>
      <td>988991</td>
    </tr>
    <tr>
      <th>green</th>
      <td>@@</td>
      <td>814252</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
# working with multi indexes , accessing only the countries where capital is green (sec. index's data)
print(dframe.xs('green', level='capital'))
#or simply,
#dframe.loc[:,'green'] #umm nope, that doesn't work

        currency  population
country
apple         @@      814252
pear          ##      322231
mango         %%        2187